## CMPINF 2100: Homework 05

### Fengyang Han

## Assigned: Tuesday of Week 05 at 11:00PM

## DUE: Tuesday of Week 06 at 11:59PM

## Overview

This assignment is more open ended than the previous ones. You must explore three data sets using the skills you have learned up to this point in the course. The Week 05 lecture material discusses the ESSENTIAL Pandas methods methods that you must ALWAYS use when BEGINNING to explore data. You must use those methods here in this assignment. You must also use SPLIT-APPLY-COMBINE to explore if summary statistics change across grouping variables. The last problem requires you to use the ESSENTIAL Pandas methods to begin exploring data associated with one of the final projects of your choosing.

**You must download the 3 data sets provided in the Canvas assignment page and save them to the appropriate directory on your computer.**

## Required tasks for Problem 01 through 03

For each of the 3 assigned data sets you must perform the following ESSENTIAL activities:

* Display the number of rows and columns in the dataset  
* Display the names of the columns and their associated data types  
* Display the number of unique values for each column  
* Display the number of MISSING values for each column  
* Display summary statistics appropriate for the data type for each column
* Count the number of rows associated with each unique value for:
    * Non-numeric columns  
    * Numeric columns with low number of unique values  

You must also execute SPLIT-APPLY-COMBINE to summarize the data based on grouping variables. Specifically, you must group by non-numeric columns and calculate the following summary statistics:
* Calculate the total number of rows for numeric columns  
* Calculate the number of non missing rows for numeric columns
* Calculate the mean and standard deviation of numeric columns
* Calculate the standard error on the mean of numeric columns
* Calculate the number of unique values for non-numeric columns

You should consider grouping by numeric columns that have low number of unique values.  

For each grouped DataFrame, you must answer the following:  
* Does the average of the numeric variables CHANGE across the groups?  

### Collaborators

Stacey Wang

## Problem 00

You will work with the NumPy and Pandas modules in this assignment.

Import NumPy and Pandas using their commonly accepted aliases.

#### 00) - SOLUTION

In [1]:
###
import numpy as np
import pandas as pd

## Problem 01

Download `hw05_prob_01.csv` from the Canvas site. Save the CSV file in the same directory as this Jupyter notebook.

Read in the `hw05_prob_01.csv` CSV file and assign it to the `df01` object.

Explore the `df01` object following **ALL** required actions listed previously.

You must add more code cells and markdown cells to complete this problem.

#### 01) - SOLUTION

In [2]:
###
df01 = pd.read_csv('./hw05_prob_01.csv')

In [3]:
## Display number of rows and columns
print("shape:" + str(df01.shape))

shape:(130, 4)

In [4]:
## Display names of the columns and their associated data types
print(df01.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 130 entries, 0 to 129
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       130 non-null    object
 1   B       130 non-null    object
 2   C       130 non-null    object
 3   x       130 non-null    float64
dtypes: float64(1), object(3)
memory usage: 4.2+ KB
None

In [5]:
## Display the number of unique values for each column 
print(df01.nunique(dropna=False))

A      2
B      2
C      2
x    130
dtype: int64

In [6]:
print(df01.nunique(dropna=True))

A      2
B      2
C      2
x    130
dtype: int64

In [7]:
## Display the number of missing values for each column
print(df01.isna().sum())

A    0
B    0
C    0
x    0
dtype: int64

In [8]:
## Display summary statistics appropriate for the data type for each column
print(df01.describe(include='all'))

          A    B    C           x
count   130  130  130  130.000000
unique    2    2    2         NaN
top      a1   b1   C2         NaN
freq     68   78   72         NaN
mean    NaN  NaN  NaN    2.155995
std     NaN  NaN  NaN    6.015095
min     NaN  NaN  NaN   -7.185043
25%     NaN  NaN  NaN   -0.715064
50%     NaN  NaN  NaN    0.828413
75%     NaN  NaN  NaN    4.375242
max     NaN  NaN  NaN   15.382198

In [9]:
## Count the number of rows associated with each unique value for Non-numberic columns and Numeric columns with low number of unique values
df01.A.value_counts(dropna=False)

a1    68
a2    62
Name: A, dtype: int64

In [10]:
df01.B.value_counts(dropna=False)

b1    78
b0    52
Name: B, dtype: int64

In [11]:
df01.C.value_counts(dropna=False)

C2    72
C1    58
Name: C, dtype: int64

In [12]:
## SPLIT-APPLY-COMBINE Calculate the total number of rows for numeric columns
df01.groupby(['A','B','C'],dropna=False).count()

           x
A  B  C
a1 b0 C1   7
      C2  22
   b1 C1  25
      C2  14
a2 b0 C1  11
      C2  12
   b1 C1  15
      C2  24

In [13]:
## Calculate the number of non missing rows for numberic columns
df01.groupby(['A','B','C'],dropna=True).count()

           x
A  B  C
a1 b0 C1   7
      C2  22
   b1 C1  25
      C2  14
a2 b0 C1  11
      C2  12
   b1 C1  15
      C2  24

In [14]:
## Calculate the mean and standard deviation of numeric columns
df01.groupby(['A','B','C'],dropna=False).\
aggregate(x_avg = ('x','mean'),
          x_std = ('x','std')).\
reset_index()

    A   B   C      x_avg     x_std
0  a1  b0  C1  -5.497979  0.696923
1  a1  b0  C2  13.542754  0.872442
2  a1  b1  C1  -0.183137  0.654817
3  a1  b1  C2   0.818355  0.687713
4  a2  b0  C1   5.459841  0.571378
5  a2  b0  C2  -0.580973  0.382814
6  a2  b1  C1  -5.899792  0.632946
7  a2  b1  C2   2.056517  0.767123

In [15]:
## Calculate the standard error on the mean of numeric columns
df01.groupby(['A','B','C'],dropna=True).\
aggregate(x_avg = ('x','mean'),
          x_std = ('x','std')).\
reset_index().x_avg.std(ddof=1)

6.230367390115699

In [16]:
## Calculate the number of unique values for non-numeric columns
df01.groupby(['A','B','C'],dropna=False).\
aggregate(A_nunique = ('A','nunique'),
            B_nunique = ('B','nunique'),
            C_nunique = ('C','nunique')).\
reset_index()

    A   B   C  A_nunique  B_nunique  C_nunique
0  a1  b0  C1          1          1          1
1  a1  b0  C2          1          1          1
2  a1  b1  C1          1          1          1
3  a1  b1  C2          1          1          1
4  a2  b0  C1          1          1          1
5  a2  b0  C2          1          1          1
6  a2  b1  C1          1          1          1
7  a2  b1  C2          1          1          1

## Problem 02

Download `hw05_prob_02.csv` from the Canvas site. Save the CSV file in the same directory as this Jupyter notebook.

Read in the `hw05_prob_02.csv` CSV file and assign it to the `df02` object.

Explore the `df02` object following **ALL** required actions listed previously.

You must add more code cells and markdown cells to complete this problem.

#### 02) - SOLUTION

In [17]:
###
df02 = pd.read_csv('./hw05_prob_02.csv')

In [18]:
## Display number of rows and columns
print("shape:" + str(df02.shape))

shape:(368, 4)

In [19]:
## Display names of the columns and their associated data types
print(df02.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 368 entries, 0 to 367
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x       368 non-null    float64
 1   y       352 non-null    float64
 2   A       347 non-null    float64
 3   G       368 non-null    int64
dtypes: float64(3), int64(1)
memory usage: 11.6 KB
None

In [20]:
## Display the number of unique values for each column
print(df02.nunique())

x    368
y    352
A      2
G     14
dtype: int64

In [21]:
## Display the number of missing values for each column
df02.isna().sum()

x     0
y    16
A    21
G     0
dtype: int64

In [22]:
## Display summary statistics appropriate for the data type for each column
print(df02.describe(include='all'))

                x           y           A           G
count  368.000000  352.000000  347.000000  368.000000
mean     0.008874    0.287405    1.608069    6.744565
std      1.017163    1.951770    0.488886    4.121450
min     -2.698471   -7.737557    1.000000    1.000000
25%     -0.696962   -0.599940    1.000000    3.000000
50%     -0.027857    0.188779    2.000000    6.000000
75%      0.607358    1.331244    2.000000   10.000000
max      2.936346    7.875071    2.000000   14.000000

In [23]:
## Count the number of rows associated with each unique value for Non-numberic columns and Numeric columns with low number of unique values
df02.y.value_counts(dropna=False)

 NaN         16
 1.226548     1
-1.461986     1
 5.096197     1
 4.478876     1
             ..
 0.155207     1
-0.048821     1
 0.001583     1
 0.247763     1
 1.795239     1
Name: y, Length: 353, dtype: int64

In [24]:
df02.A.value_counts(dropna=False)

2.0    211
1.0    136
NaN     21
Name: A, dtype: int64

In [25]:
## SPLIT-APPLY-COMBINE Calculate the total number of rows for numeric columns
df02.groupby(['A'],dropna=False).count()

       x    y    G
A
1.0  136  120  136
2.0  211  211  211
NaN   21   21   21

In [26]:
## Calculate the number of non missing rows for numberic columns
df02.groupby(['A'],dropna=True).count()

       x    y    G
A
1.0  136  120  136
2.0  211  211  211

In [27]:
## Calculate the mean and standard deviation of numeric columns
df02.groupby(['A'],dropna=False).\
aggregate(x_avg = ('x','mean'),
          x_std = ('x','std'),
          y_avg = ('y','mean'),
          y_std = ('y','std'),
          G_avg = ('G','mean'),
          G_std = ('G','std')).\
reset_index()

     A     x_avg     x_std     y_avg     y_std      G_avg     G_std
0  1.0 -0.071118  1.007348  0.097019  1.935619   8.573529  2.671197
1  2.0  0.029215  1.020511  0.435802  2.025692   5.028436  3.871649
2  NaN  0.322540  1.024403 -0.115713  0.925330  12.142857  4.661392

In [28]:
## Calculate the standard error on the mean of numeric columns
df02.groupby(['A'],dropna=True).\
aggregate(x_avg = ('x','mean'),
          x_std = ('x','std'),
          y_avg = ('y','mean'),
          y_std = ('y','std'),
          G_avg = ('G','mean'),
          G_std = ('G','std')).\
reset_index()[['x_avg','y_avg','G_avg']].std(ddof=1)

x_avg    0.070946
y_avg    0.239556
G_avg    2.506760
dtype: float64

In [29]:
## Calculate the number of unique values for non-numeric columns
## No non-numeric columns

## Problem 03

Download `hw05_prob_03.csv` from the Canvas site. Save the CSV file in the same directory as this Jupyter notebook.

Read in the `hw05_prob_03.csv` CSV file and assign it to the `df03` object.

Explore the `df03` object following **ALL** required actions listed previously.

You must add more code cells and markdown cells to complete this problem.

#### 03) - SOLUTION

In [30]:
##
df03 = pd.read_csv('./hw05_prob_03.csv')

In [31]:
## Display number of rows and columns
print("shape:" + str(df03.shape))

shape:(1407, 3)

In [32]:
## Display names of the columns and their associated data types
print(df03.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1407 entries, 0 to 1406
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   obs_id  1407 non-null   int64
 1   key     1407 non-null   object
 2   value   1379 non-null   float64
dtypes: float64(1), int64(1), object(1)
memory usage: 33.1+ KB
None

In [33]:
## Display the number of unique values for each column
df03.nunique()

obs_id     201
key          7
value     1379
dtype: int64

In [34]:
## Display the number of missing values for each column
df03.isna().sum()

obs_id     0
key        0
value     28
dtype: int64

In [35]:
## Display summary statistics appropriate for the data type for each column
print(df03.describe(include='all'))

             obs_id   key        value
count   1407.000000  1407  1379.000000
unique          NaN     7          NaN
top             NaN    x1          NaN
freq            NaN   201          NaN
mean     101.000000   NaN    -2.222709
std       58.043614   NaN     4.465882
min        1.000000   NaN   -25.362015
25%       51.000000   NaN    -2.683234
50%      101.000000   NaN    -0.798222
75%      151.000000   NaN     0.250730
max      201.000000   NaN     4.209716

In [36]:
## Count the number of rows associated with each unique value for Non-numberic columns and Numeric columns with low number of unique values
df03.key.value_counts(dropna=False)

x1    201
x2    201
x3    201
x4    201
x5    201
x6    201
x7    201
Name: key, dtype: int64

In [37]:
## SPLIT-APPLY-COMBINE Calculate the total number of rows for numeric columns
df03.groupby(['key'],dropna=False).count()

     obs_id  value
key
x1      201    201
x2      201    201
x3      201    197
x4      201    201
x5      201    201
x6      201    197
x7      201    181

In [38]:
## Calculate the number of non missing rows for numberic columns
df03.groupby(['key'],dropna=True).count()

     obs_id  value
key
x1      201    201
x2      201    201
x3      201    197
x4      201    201
x5      201    201
x6      201    197
x7      201    181

In [39]:
## Calculate the mean and standard deviation of numeric columns
df03.groupby(['key'],dropna=False).\
aggregate(obs_id_avg = ('obs_id','mean'),
          obs_id_std = ('obs_id','std'),
          value_avg = ('value','mean'),
            value_std = ('value','std')).\
reset_index()

  key  obs_id_avg  obs_id_std  value_avg  value_std
0  x1       101.0   58.167861  -0.160787   1.735903
1  x2       101.0   58.167861   0.100830   0.095558
2  x3       101.0   58.167861  -0.050132   1.544633
3  x4       101.0   58.167861 -10.187219   5.079706
4  x5       101.0   58.167861   1.061053   0.935690
5  x6       101.0   58.167861  -1.463831   0.591750
6  x7       101.0   58.167861  -5.085382   3.002404

In [40]:
## Calculate the standard error on the mean of numeric columns
df03.groupby(['key'],dropna=True).\
aggregate(obs_id_avg = ('obs_id','mean'),
          obs_id_std = ('obs_id','std'),
          value_avg = ('value','mean'),
            value_std = ('value','std')).\
reset_index()[['obs_id_avg','value_avg']].std(ddof=1)

obs_id_avg    0.000000
value_avg     4.028036
dtype: float64

In [41]:
## Calculate the number of unique values for non-numeric columns
df03.groupby(['key'],dropna=False).\
aggregate(key_nunique = ('key','nunique')).\
reset_index()

  key  key_nunique
0  x1            1
1  x2            1
2  x3            1
3  x4            1
4  x5            1
5  x6            1
6  x7            1

## Problem 04

You must download the data associated with one of the Final Projects from the Canvas site. Save the file(s) in the same directory as this Jupyter notebook.

Read in the data associated with one of the Final Projects. You must perform the ESSENTIAL activities listed previously.

You do **NOT** need to SPLIT-APPLY-COMBINE to explore across groups for this assignment.

#### 04) - SOLUTION